10/data/attachments/3590bed5d829530f.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_2935d071-2063-4a52-a53a-1e27dd4dfeea</nif:username>
            <nif:friendToBeAdded>Erica_ready_Friend_87438_6</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>